In [2]:
# 파이썬 라이브러리
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [9]:
# 데이터 불러오기 > population.csv


population = pd.read_csv("./data/population.csv",index_col = "도시")

In [8]:
population

     지역     2020        2015        2010      2005
도시
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [15]:
<<<<<<< HEAD
=======

     지역     2020       2015  2010     2005
도시
부산  경상권  3391946        NaN   NaN  3628293
인천  수도권  2942828  2925815.0   NaN  2600495

In [ ]:
>>>>>>> 25e36674efc8db341eb0e9886e03bbfe4afc2574
# 원하는 데이터 추출하기
# loc(Location) : 인덱스를 기준으로 행을 추출, '컬럼 이름으로 접근'
# loc[행, 열] -> ㄱ끝 열을 포함하지 않는다. ex) df명.loc[부산 : 인천]
# iloc(Integer Location) : 행 번호를 기준으로 데이터를 추출, '행 번호로 접근'
# iloc[행,열] -> 끝 열을 포함하는
population.loc['부산' : '인천']

In [17]:
# 인천에 2015년도 인구수 행을 추출 > 2925815.0
# loc를 사용

population.loc['인천','2015']

2925815.0

In [20]:
# 부산에서 인천까지의 2020년~2010년까지의 인구 수를 추출
population.iloc[1:3,1:4]

       2020       2015  2010
도시
부산  3391946        NaN   NaN
인천  2942828  2925815.0   NaN

In [23]:
population.iloc[0:3,2:4]

          2015        2010
도시
서울  10022181.0  10312545.0
부산         NaN         NaN
인천   2925815.0         NaN

In [28]:
population.loc['부산':'인천','2010']

도시
부산   NaN
인천   NaN
Name: 2010, dtype: float64

### 그외 함수를 사용하기
    - count() : 데이터 개수를 세는 함수
    - values_counts() : 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 세는 함수
    - sort_index() : 인덱스 값을 기준으로 정렬
    - sort_values() : 데이터 값을 기준으로 정렬
    - fillna() :  결측치(NaN) 에 원하는 값 지정

In [31]:
# count()
# axis : 축방향
# axis = 0 :  행 축: 위에서 아래로 축 행을 기준으로 작업
# axis = 1 : 열 축: 왼쪽에서 오른쪽로 축 컬럼을 기준으로 작업

population.count(axis = 0)

지역      5
2020    5
2015    4
2010    3
2005    5
dtype: int64

In [32]:
# 2020년도 특정 컬럼의 카룬트를 세워보자

population['2020'].value_counts()

2020
9668465    1
3391946    1
2942828    1
1450062    1
2418436    1
Name: count, dtype: int64

In [34]:
population.sort_values(by = '2010', ascending = False)
population.sort_values(by = ['지역','2020'], ascending = False)

     지역     2020        2015        2010      2005
도시
광주  전라권  1450062   1474636.0   1454636.0   1401745
서울  수도권  9668465  10022181.0  10312545.0  10167344
인천  수도권  2942828   2925815.0         NaN   2600495
부산  경상권  3391946         NaN         NaN   3628293
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [41]:
# 데이터 프레임 형태로 확인하고 싶은면 []안에 []를 쓴다.
population[['2015']]


population.fillna(value = 0)

     지역     2020        2015        2010      2005
도시
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         0.0         0.0   3628293
인천  수도권  2942828   2925815.0         0.0   2600495
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [6]:
# 1. 라이브러리 불러오기 : train.csv
train = pd.read_csv("./train.csv", index_col = 'PassengerId')

# 2. train 이라는 변수에 저장
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# 데이터 정보
# PassengerId : 승객별 아이디
# Survived : 생존여부 > 0: 사망 1: 생존
# Pclass : 객싱 등급 1등급, 2등급, 3등급
# Sibsp : 합성어 > 배우자와 형제 자매가 같이 탑승한 수
# Parch : 합성어 > 같이 탑승 가족 수
# Fare : 요금
# Cabin : 객실 번호
# Embarked : 생선지 > S, C, Q

In [10]:
# head() : 상단의 5개의 데이터만 보여줌
# tail(): 하단의 5개의 데이터만 보여줌

train.head()
train.count()

train['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [14]:
# 연습문제 1
# 타이타닉호 승객 중 성별 인원수(Sex), 선실별 인원수(Pclass), 사망/생존의 인원수(survived)를 구하라.
print(train['Sex'].value_counts())

print(train['Pclass'].value_counts())

print(train['Survived'].value_counts())

Sex
male      577
female    314
Name: count, dtype: int64
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
Survived
0    549
1    342
Name: count, dtype: int64

In [20]:
train[train['Sex']  == 'female'].value_counts('Survived')

Survived
1    233
0     81
Name: count, dtype: int64

In [21]:
# 성별이 남자에 해당하는 사망/생존 의 인원수를 구하고
# male_survived 변수에 저장해보자!
male_survived = train[train['Sex']  == 'male'].value_counts('Survived')

male_survived

Survived
0    468
1    109
Name: count, dtype: int64

In [ ]:
<<<<<<< HEAD
## del(train['Age'])
## del(train['Cabin'])
##train['Embarked'].value_counts('S')
train['Embarked'].fillna(value = 'S',inplace = True)

train.count()

In [ ]:
import chardet
with open ('./data/hr-info.csv', 'rb') as f : 
    data = f.read()

In [ ]:
chardet.detect(data)

In [ ]:
## 한글 인코딩의 종류 : EUC-KR, UTF-8, UTF-8-SIG, cp949
hr_info = pd.read_csv('./data/hr-info.csv',encoding = 'EUC-KR')
hr_info

In [ ]:
#DESC(Describe)
describe()

In [ ]:

### github체크